app/Http/Controllers/AdminController.php

	public function dashboard()
	{

		try{

			Session::put('user', Auth::User());

			/*$UserRequest = UserRequests::with('service_type')->with('provider')->with('payment')->findOrFail(83);

			echo "<pre>";
			print_r($UserRequest->toArray());exit;

			return view('emails.invoice',['Email' => $UserRequest]);*/


			$rides = UserRequests::has('user')->orderBy('id','desc')->get();
			$cancel_rides = UserRequests::where('status','CANCELLED');
			$scheduled_rides = UserRequests::where('status','SCHEDULED')->count();
			$user_cancelled = UserRequests::where('status','CANCELLED')->where('cancelled_by','USER')->count();
			$provider_cancelled = UserRequests::where('status','CANCELLED')->where('cancelled_by','PROVIDER')->count();
			$cancel_rides = $cancel_rides->count();
			$service = ServiceType::count();
			$fleet = Fleet::count();
			$provider = Provider::count();
			$revenue = UserRequestPayment::sum('total');
			$wallet['tips'] = UserRequestPayment::sum('tips');
			$providers = Provider::take(10)->orderBy('rating','desc')->get();
			$wallet['admin'] = AdminWallet::sum('amount');
			$wallet['provider_debit'] = Provider::select(DB::raw('SUM(CASE WHEN wallet_balance<0 THEN wallet_balance ELSE 0 END) as total_debit'))->get()->toArray();
			$wallet['provider_credit'] = Provider::select(DB::raw('SUM(CASE WHEN wallet_balance>=0 THEN wallet_balance ELSE 0 END) as total_credit'))->get()->toArray();
			$wallet['fleet_debit'] = Fleet::select(DB::raw('SUM(CASE WHEN wallet_balance<0 THEN wallet_balance ELSE 0 END) as total_debit'))->get()->toArray();
			$wallet['fleet_credit'] = Fleet::select(DB::raw('SUM(CASE WHEN wallet_balance>=0 THEN wallet_balance ELSE 0 END) as total_credit'))->get()->toArray();

			$wallet['admin_tax'] = AdminWallet::where('transaction_type',9)->sum('amount');
			$wallet['admin_commission'] = AdminWallet::where('transaction_type',1)->sum('amount');
			$wallet['admin_discount'] = AdminWallet::where('transaction_type',10)->sum('amount');
			$wallet['admin_referral'] = AdminWallet::where('transaction_type',12)->orWhere('transaction_type',13)->sum('amount');
			$wallet['admin_dispute'] = AdminWallet::where('transaction_type',16)->orWhere('transaction_type',17)->sum('amount');
			$wallet['peak_commission'] = AdminWallet::where('transaction_type',14)->sum('amount');
			$wallet['waiting_commission'] = AdminWallet::where('transaction_type',15)->sum('amount');
---
select * from `user_requests` where exists (select * from `users` where `user_requests`.`user_id` = `users`.`id`) and `user_requests`.`deleted_at` is null order by `id` desc
select count(*) as aggregate from `user_requests` where `status` = 'SCHEDULED' and `user_requests`.`deleted_at` is null
select count(*) as aggregate from `user_requests` where `status` = 'CANCELLED' and `cancelled_by` = 'USER' and `user_requests`.`deleted_at` is null
select count(*) as aggregate from `user_requests` where `status` = 'CANCELLED' and `cancelled_by` = 'PROVIDER' and `user_requests`.`deleted_at` is null
select count(*) as aggregate from `user_requests` where `status` = 'CANCELLED' and `user_requests`.`deleted_at` is null
select * from `providers` order by `rating` desc limit 10
select SUM(CASE WHEN wallet_balance<0 THEN wallet_balance ELSE 0 END) as total_debit from `providers`
select SUM(CASE WHEN wallet_balance>=0 THEN wallet_balance ELSE 0 END) as total_credit from `providers`
select SUM(CASE WHEN wallet_balance<0 THEN wallet_balance ELSE 0 END) as total_debit from `fleets`
select SUM(CASE WHEN wallet_balance>=0 THEN wallet_balance ELSE 0 END) as total_credit from `fleets`
select sum(`amount`) as aggregate from `admin_wallet` where `transaction_type` = 9
select sum(`amount`) as aggregate from `admin_wallet` where `transaction_type` = 1
select sum(`amount`) as aggregate from `admin_wallet` where `transaction_type` = 10
select sum(`amount`) as aggregate from `admin_wallet` where `transaction_type` = 12 or `transaction_type` = 13
select sum(`amount`) as aggregate from `admin_wallet` where `transaction_type` = 16 or `transaction_type` = 17
select sum(`amount`) as aggregate from `admin_wallet` where `transaction_type` = 14
select sum(`amount`) as aggregate from `admin_wallet` where `transaction_type` = 15