app/Http/Controllers/DispatcherController.php

    public function trips(Request $request)
    {
        $Trips = UserRequests::with('user', 'provider')
                    ->orderBy('id','desc');

        if($request->type == "SEARCHING"){
            $Trips = $Trips->where('status',$request->type);
        }else if($request->type == "CANCELLED"){
            $Trips = $Trips->where('status',$request->type);
        }else if($request->type == "ASSIGNED"){
            $Trips = $Trips->whereNotIn('status',['SEARCHING','SCHEDULED','CANCELLED','COMPLETED']);
        }

        $Trips =  $Trips->paginate(10);
---
select * from `providers` where `providers`.`id` in (0)
select * from `user_requests` where `status` = 'CANCELLED' and `user_requests`.`deleted_at` is null order by `id` desc limit 10 offset 0
select * from `users` where `users`.`id` in (275, 759, 760)
select count(*) as aggregate from `user_requests` where `status` not in ('SEARCHING', 'SCHEDULED', 'CANCELLED', 'COMPLETED') and `user_requests`.`deleted_at` is null

    public function userByMobile(Request $request)
    {
        $user = User::where('mobile', $request->mobile)->first();
---
select * from `users` where `mobile` = '51231365' limit 1