app/Http/Controllers/Resource/ServiceResource.php

    public function index(Request $request)
    {
        $services = ServiceType::all();
---
select * from `service_types`